:PROPERTIES:
:ID:       04B03591-50E7-41E2-A2A5-0C2893FAD39C
:END:
#+title: org-babel

Org Babel is a literate programming environment using org mode in [[id:436EB0B7-811E-4828-BBF7-4126517DD7C6][emacs]].

As evidenced by this repository, I'm fairly keen on it.
I'm also toying with expanding this into a wider project called [[id:0F78767D-42FF-4027-B3A2-26CA1898F788][obi]].


I first started using it several years ago, but largely shelved it in favor of
lighter touch solutions, but more recently with the rise of using AI for coding
the model provided by org-babel seems particularly appropriate - resulting in options
like the babel files capturing what amount to live lab notebooks that were used to
drive the work of the agents.

* Languages

- [[id:222093AC-E4FC-4E90-B124-ADFFC31F6314][emacs-lisp]]
- [[id:72258C97-F88E-4498-825D-A7447EC008AA][java]]
- [[id:002B2928-C32F-49F3-B93F-CBEEE215A7D7][python]]
- [[id:3368C2A8-C34F-45C2-8601-1735BD712D74][shell]]

* Arguments

** :post

Post Processing

#+name: test-post
#+begin_src shell :var val=""
  echo "${val}-post"
#+end_src

#+RESULTS: test-post

#+begin_src shell :results output :post test-post(val=*this*)
  echo -n 'foo'
#+end_src

#+RESULTS:
: foo-post

#+name: from-json
#+begin_src emacs-lisp :var input="" :results value
  (json-parse-string input)
#+end_src

#+RESULTS: from-json

#+begin_src shell :results output :post from-json(input=*this*)
  echo -n '[1,2,3,4]'
#+end_src

#+RESULTS:
: [1 2 3 4]

#+begin_src shell :results output :post from-json(input=*this*)
  echo -n '{"foo": "bar"}'
#+end_src

#+RESULTS:
: #s(hash-table test equal data ("foo" "bar"))

#+begin_src shell :results table
  echo 'foo,bar'
#+end_src

#+BEGIN_SRC shell :results table
  echo '[1,2,3, "foo"]' | jq -r '@csv'
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | foo |

#+BEGIN_SRC shell :results table :async :session ob-test
  echo '[1,2,3, "foo"]' | jq -r '@csv'
#+END_SRC

#+RESULTS:
: echo '[1,2,3, "foo"]' | jq -r '@csv'
: 1,2,3,"foo"
: [?2004hecho 'ob_comint_async_shell_end_31aa6728-dfec-43ea-8f97-2414b24181ff'[?2004l


Post processing typically only works with sync blocks, and once async is started it stays async.
Collect some recipes for dealing with this...may be easier to push this into the shell than to try to pull it in to babel.
If there's a way to get CSV/TSV to play better that seems nicer.

A built in jq formatter also seems appealing but not available as an extension point.

** :prologue
:PROPERTIES:
:ID:       BDA4C8F0-3B66-4819-B2B1-BBC8FE727EBC
:END:
Define some content to inject prior to the body.

** :results

*** what is captured

**** value

The default, with some DWIM formatting.

#+begin_src emacs-lisp :results value
  (list 1 2 3)
#+end_src

#+RESULTS:
| 1 | 2 | 3 |

Some languages may require more help to actually return the value
(either due to inherent behavior or being run within some type of wrapper.

#+begin_src python :results value
  return (1,2,3)
#+end_src

#+RESULTS:
| 1 | 2 | 3 |

** :var

Set the named variable to the provided value.
This seems to be supported by synthesizing relevant assignment statements.

*** String Literal

#+begin_src emacs-lisp :var foo="bar"
  (format "foo=%s" foo)
#+end_src

#+RESULTS:
: foo=bar

*** Numeric Literal

#+begin_src emacs-lisp :var foo=1
  (+ foo 2)
#+end_src

#+RESULTS:
: 3

*** Expression

#+begin_src emacs-lisp :var foo=(buffer-name)
  foo
#+end_src

#+RESULTS:
: 20260615111334-org_babel.org

*** Named Block

This can also make use of richer content like tables and lists.

#+name: foo
A line of text

#+begin_src emacs-lisp :var foo=foo
  foo
#+end_src

#+RESULTS:
: A line of text

*** Evaluated Block

Also just throw in a demonstration of passing the values across languages.

#+name: foo-block
#+begin_src emacs-lisp
  (concat "biz" "baz")
#+end_src

For this case parentheses can optionally be included after the block name.

#+begin_src python :var foo=foo-block
  return foo
#+end_src

#+RESULTS:
: bizbaz

* Configuration

** org-confirm-babel-evaluate

#+begin_src emacs-lisp
  (describe-variable 'org-confirm-babel-evaluate)
#+end_src

#+RESULTS:
#+begin_example
org-confirm-babel-evaluate is a variable defined in ‘ob-core.el’.

Its value is nil
Original value was t

Confirm before evaluation.
Require confirmation before interactively evaluating code
blocks in Org buffers.  The default value of this variable is t,
meaning confirmation is required for any code block evaluation.
This variable can be set to nil to inhibit any future
confirmation requests.  This variable can also be set to a
function which takes two arguments the language of the code block
and the body of the code block.  Such a function should then
return a non-nil value if the user should be prompted for
execution or nil if no prompt is required.

Warning: Disabling confirmation may result in accidental
evaluation of potentially harmful code.  It may be advisable
remove code block execution from ‘C-c C-c’ as further protection
against accidental code block evaluation.  The
‘org-babel-no-eval-on-ctrl-c-ctrl-c’ variable can be used to
remove code block execution from the ‘C-c C-c’ keybinding.

  This variable is safe as a file local variable if its value
  satisfies the predicate which is a compiled expression.
  This variable was introduced, or its default value was changed, in
  version 24.1 of Emacs.
  You can customize this variable.

#+end_example

YOLO

#+begin_src emacs-lisp
  (setq org-confirm-babel-evaluate nil)
#+end_src

** org-src-tab-acts-natively

#+begin_src emacs-lisp
  (describe-variable 'org-src-tab-acts-natively)
#+end_src

#+RESULTS:
#+begin_example
org-src-tab-acts-natively is a variable defined in ‘org-src.el’.

Its value is t

If non-nil, TAB uses the language’s major-mode binding in code blocks.

  This variable was introduced, or its default value was changed, in
  version 9.4 of the Org package that is part of Emacs 27.2.
  You can customize this variable.

#+end_example

#+begin_src emacs-lisp
  (setq org-src-tab-active-natively t)
#+end_src

* Practices
** Packaging Up Behaviors
:PROPERTIES:
:ID:       DF79A72C-570A-49C8-A566-D494C59F732C
:END:

A major driver fro using org-babel is that it keeps the machinery
exposed and allows working with some sizeable chunks. As part of this
there will be a balance between approaches like copypasta and more
in-built functionality.

The rule of thumb is likely to keep things either very dumb and simple
(and rely on copypasta) or have them clearly defined as built in to
the engine. The undesriable middle ground is where functionality is
both not clearly defined as something that is provided, nor is it
clearly visible.
** Async Execution

One underlying goal would be to have everything async by default. This
seems fairly likely to invite splitting out [[id:0F78767D-42FF-4027-B3A2-26CA1898F788][obi]], but I'll see how far
this can get by default. Much of this should be able to be driven by async.

* Definition of Header Args

Most of the packages define the header args, but for the languages themsleves
the need/value is unclear (there's likely more info within the core org-babel code).

* Usage
** org-babel-execute-src-block
:PROPERTIES:
:ID:       D7816316-280D-4B7B-9420-3E33264E24D2
:END:

This is the main entrypoint...it's large enough that I want to split
it up which I guess I'll start tackling in [[id:31893E0D-17BB-4DE7-8C4D-9D98E2D23856][obi/execute-src-block]]

#+begin_src emacs-lisp
  (describe-function #'org-babel-execute-src-block)
#+end_src

#+RESULTS:
#+begin_example
org-babel-execute-src-block is an autoloaded interactive
byte-code-function in ‘ob-core.el’.

(org-babel-execute-src-block &optional ARG INFO PARAMS EXECUTOR-TYPE)

Execute the current source code block and return the result.
Insert the results of execution into the buffer.  Source code
execution and the collection and formatting of results can be
controlled through a variety of header arguments.

With prefix argument ARG, force re-execution even if an existing
result cached in the buffer would otherwise have been returned.

Optionally supply a value for INFO in the form returned by
‘org-babel-get-src-block-info’.

Optionally supply a value for PARAMS which will be merged with
the header arguments specified at the front of the source code
block.

EXECUTOR-TYPE is the type of the org element responsible for the
execution of the source block.  If not provided then informed
guess will be made.

#+end_example
** org-babel-current-src-block-location

This mostly feels like something that should just be contained as
paramters/variables within stack frames. The defined variable seems
likely to introduce challenges or complications with concurrency
(which seems typical of emacs).

#+begin_src emacs-lisp
  (describe-variable 'org-babel-current-src-block-location)
#+end_src

#+RESULTS:
#+begin_example
org-babel-current-src-block-location is a variable defined in ‘ob-core.el’.

Its value is 8370

Marker pointing to the source block currently being executed.
This may also point to a call line or an inline code block.  If
multiple blocks are being executed (e.g., in chained execution
through use of the :var header argument) this marker points to
the outer-most code block.

#+end_example

* Implementation Information

** Configuration

*** org-babel-check-evaluate

#+begin_src emacs-lisp
  (describe-function #'org-babel-check-evaluate)
#+end_src

The docs for this function are lacking...check how?

#+RESULTS:
: org-babel-check-evaluate is a byte-code-function in ‘ob-core.el’.
: 
: (org-babel-check-evaluate INFO)
: 
: Check if code block INFO should be evaluated.
: Do not query the user, but do display an informative message if
: evaluation is blocked.  Returns non-nil if evaluation is not blocked.
: 

Internally this just translates to a wrapped call to
org-babel-check-confirm-evaluate

*** org-babel-check-confirm-evaluate

#+begin_src emacs-lisp
  (describe-function #'org-babel-check-confirm-evaluate)
#+end_src

#+RESULTS:
#+begin_example
org-babel-check-confirm-evaluate is a byte-code-function in
‘ob-core.el’.

(org-babel-check-confirm-evaluate INFO)

Check whether INFO allows code block evaluation.

Returns nil if evaluation is disallowed, t if it is
unconditionally allowed, and the symbol ‘query’ if the user
should be asked whether to allow evaluation.

#+end_example

** General Utilities
*** org-babel-chomp

A specialized function shouldn't be needed.

#+begin_src emacs-lisp
  (describe-function #'org-babel-chomp)
#+end_src

#+RESULTS:
: org-babel-chomp is a byte-code-function in ‘ob-core.el’.
: 
: (org-babel-chomp STRING &optional REGEXP)
: 
: Strip a trailing space or carriage return from STRING.
: The default regexp used is "[ \f\t\n\r\v]" but another one
: can be specified as the REGEXP argument.
: 
** Options
*** org-babel-get-src-block-info
:PROPERTIES:
:ID:       07E2C869-F716-4F4B-9FFA-1EF81ABF7CF8
:END:

This definition seems reasonably close to [[id:6292A2C7-5E3E-4CF2-89ED-D184351F116B][chunkable-length]] and so will
be left in place and analyzed here (rather than being decomposed).

The function makes use of the optional datum argument, defaulting to
the active context and then only executes if the datum is an
inline-src-block or src-block.

The :language org property is the language for the block which seems
to be a reasonable part of the org API ostensibly covered elsewhere.

The info structure is then composed of a list of:
- language
- body
- params (merged with levels of defaults)...potentially processed and
  with file destination resolved
- switches?
- name (if present)
- start as determined by begin or post-affiliated
- format string for block coderef
(documented below also but what some of the things mean can be
expanded above).

#+begin_src emacs-lisp
  (describe-function #'org-babel-get-src-block-info)
#+end_src

#+RESULTS:
#+begin_example
org-babel-get-src-block-info is a byte-code-function in ‘ob-core.el’.

(org-babel-get-src-block-info &optional NO-EVAL DATUM)

Extract information from a source block or inline source block.

When optional argument NO-EVAL is non-nil, Babel does not resolve
remote variable references; a process which could likely result
in the execution of other code blocks, and do not evaluate Lisp
values in parameters.

By default, consider the block at point.  However, when optional
argument DATUM is provided, extract information from that parsed
object instead.

Return nil if point is not on a source block (blank lines after a
source block are considered a part of that source block).
Otherwise, return a list with the following pattern:

  (language body arguments switches name start coderef)

#+end_example

** Temp File Creation

This behavior itself should be generalized, but having the separate
variable seems to makes sense. It seems like it may be better to
have this be a function that closes over the variable, but from the
perspective of the exposed interface that doesn't seem important.

*** org-babel-temp-file

#+begin_src emacs-lisp
  (describe-function #'org-babel-temp-file)
#+end_src

#+RESULTS:
: org-babel-temp-file is a byte-code-function in ‘ob-core.el’.
: 
: (org-babel-temp-file PREFIX &optional SUFFIX)
: 
: Create a temporary file in the ‘org-babel-temporary-directory’.
: Passes PREFIX and SUFFIX directly to ‘make-temp-file’ with the
: value of function ‘temporary-file-directory’ temporarily set to the
: value of ‘org-babel-temporary-directory’.
: 

*** org-babel-temporary-directory

#+begin_src emacs-lisp
  (describe-variable 'org-babel-temporary-directory)
#+end_src

#+RESULTS:
: org-babel-temporary-directory is a variable defined in ‘ob-core.el’.
: 
: Its value is
: "/var/folders/y1/qpq5h9vd44dgw77dx8jb00380000gn/T/babel-YPmWu4"
: 
: Directory to hold temporary files created to execute code blocks.
: Used by ‘org-babel-temp-file’.  This directory will be removed on
: Emacs shutdown.
: 

** Comint

*** org-babel-comint-async-register

#+begin_src emacs-lisp
  (describe-function #'org-babel-comint-async-register)
#+end_src

#+RESULTS:
#+begin_example
org-babel-comint-async-register is a byte-code-function in
‘ob-comint.el’.

(org-babel-comint-async-register SESSION-BUFFER ORG-BUFFER
INDICATOR-REGEXP CHUNK-CALLBACK FILE-CALLBACK)

Set local org-babel-comint-async variables in SESSION-BUFFER.
ORG-BUFFER is added to ‘org-babel-comint-async-buffers’ if not
present.  ‘org-babel-comint-async-indicator’,
‘org-babel-comint-async-chunk-callback’, and
‘org-babel-comint-async-file-callback’ are set to
INDICATOR-REGEXP, CHUNK-CALLBACK, and FILE-CALLBACK
respectively.

#+end_example

*** org-babel-comint-eval-invisibly-and-wait-for-file

There seems to be nothing ob specific about this.

#+begin_src emacs-lisp
  (describe-function #'org-babel-comint-eval-invisibly-and-wait-for-file)
#+end_src

#+RESULTS:
#+begin_example
org-babel-comint-eval-invisibly-and-wait-for-file is a
byte-code-function in ‘ob-comint.el’.

(org-babel-comint-eval-invisibly-and-wait-for-file BUFFER FILE STRING
&optional PERIOD)

Evaluate STRING in BUFFER invisibly.
Don’t return until FILE exists.  Code in STRING must ensure that
FILE exists at end of evaluation.

#+end_example

*** org-babel-comint-with-output

This function looks promising for general use.
Much of the body seems like it could be replaced by generalized logic.

#+begin_src emacs-lisp
  (describe-function #'org-babel-comint-with-output)
#+end_src

#+RESULTS:
#+begin_example
org-babel-comint-with-output is a Lisp macro in ‘ob-comint.el’.

(org-babel-comint-with-output META &rest BODY)

Evaluate BODY in BUFFER and return process output.
Will wait until EOE-INDICATOR appears in the output, then return
all process output.  If REMOVE-ECHO and FULL-BODY are present and
non-nil, then strip echo’d body from the returned output.  META
should be a list containing the following where the last two
elements are optional.

 (BUFFER EOE-INDICATOR REMOVE-ECHO FULL-BODY)

This macro ensures that the filter is removed in case of an error
or user ‘keyboard-quit’ during execution of body.

#+end_example

** Process

I'd probably look to avoid this and use comint for all the things.

*** org-babel-eval

#+begin_src emacs-lisp
  (describe-function #'org-babel-eval)
#+end_src

#+RESULTS:
#+begin_example
org-babel-eval is a byte-code-function in ‘ob-eval.el’.

(org-babel-eval COMMAND QUERY)

Run COMMAND on QUERY.
Return standard output produced by COMMAND.  If COMMAND exits
with a non-zero code or produces error output, show it with
‘org-babel-eval-error-notify’.

Writes QUERY into a temp-buffer that is processed with
‘org-babel--shell-command-on-region’.

#+end_example

* Spelunking

As part of building out [[id:95B942E1-D6F6-42CC-9A8F-E49F23482AB9][ob-tla]] I'll start picking through the standard
babel implementations.

I have a background effort to get up to speed on the [[id:436EB0B7-811E-4828-BBF7-4126517DD7C6][emacs]] source code as a whole,
but that's a substantially larger effort.

** Languages

*** [[file:/Applications/Emacs.app/Contents/Resources/lisp/org/ob-C.el.gz][ob-C]]
Support for [[id:B55CCD9A-F769-4369-AB9E-AD1F64A3B9C6][C]]/C++/D - heavy on converting data to code and handling scaffolding
Not much in the way of interesting process support.

** Utilities

For supporting async interactions I was mostly expecting to want to
use comint, so I've appropriately been led to
[[file:/Applications/Emacs.app/Contents/Resources/lisp/org/ob-comint.el.gz][ob-comint]].

ob-comint is fairly lightweight with a couple functions that should
likely be generalized, one or two that seem worth decomposing, and
some that seem worth leaving alone.
